<?php

return [
    'user' => [
        'created' => 'تم إنشاء المستخدم بنجاح.',
        'updated' => 'تم تحديث بيانات المستخدم بنجاح.',
        'deleted' => 'تم حذف المستخدم بنجاح.',
        'not-found' => 'لم يتم العثور على المستخدم.',
        'image_upload_failed'=>'فشل تحميل الصورة.',
        'device_exists' => 'الجهاز مسجل فعلا.',
        'get' => 'تم عرض المستخدم بنجاح.',
        'list_admins_and_teachers' => 'تم جلب الاساتذة و المدراء.'
    ],
    'auth' => [
        'login' => 'تم تسجيل الدخول بنجاح.',
        'logout' => 'تم تسجيل الخروج بنجاح.',
        'permission_denied' => 'ليس لديك صلاحية للقيام بهذا الأمر.',
        'invalid_password' => 'كلمة مرور غير صحيحة!.',
        'invalid_token' => '.الرمز غير صحيح او منتهي الصلاحية',
        'refresh' => 'تم تحديث الرمز.',
        'password_changed' => 'تم تغيير كلمة المرور بنجاح.',
        'reset_link_sent' => 'تم ارسال رابط اعادة تعيين كلمة السر.',
        'invalid_role' => 'غير مسموح تسجيل الدخول بمستخدم من هذا النوع.',
        'pass_role' => 'يجب تمرير دور موجود.',
        'invalid_username_prefix' => 'بادئة اسم المستخدم غير صالحة.',
        'invalid_user_id' => 'معرف المستخدم غير صالح.'
    ],
    'quiz' => [
        'created' => 'تم إنشاء الاختبار المؤتمت بنجاح.',
        'activated' => 'تم تفعيل الاختبار المؤتمت بنجاح.',
        'not-found' => 'لم يتم إيجاد الاختبار المؤتمت.',
        'already_active' => 'الاختبار المؤتمت مفعل بالفعل.',
        'deactivated' => 'تم تعطيل الاختبار المؤتمت بنجاح.',
        'already_inactive' => 'الاختبار المؤتمت معطل بالفعل.',
        'updated' => 'تم تعديل الاختبار المؤتمت.',
        'deleted' => 'تم حذف الاختبار المؤتمت.',
        'score_already_submitted' => 'علامة الاختبار المؤتمت مرفوعة بالفعل.',
        'score_created' => 'تم رفع علامة الاختبار المؤتمت.',
        'score_must_not_exceed' => 'علامة الاختبار المؤتمت لا يجب ان تتعدى',
        'listed' => 'تم عرض الاختبارات المؤتمتة.',
        'fetched' => 'تم جلب الاختبار المؤتمت بنجاح.'
    ],
    'question' => [
        'created' => 'تم إنشاء السؤال.',
        'already_exists' => 'السؤال موجود بالفعل في الاختبار.',
        'invalid_right_choice' => 'حقل الخيار الصحيح غير صالح.',
        'not-found' => 'لم يتم إيجاد السؤال.',
        'invalid_text' => 'سؤال غير صالح.',
        'updated' => 'تم تحديث السؤال بنجاح.',
        'deleted' => 'تم حذف السؤال بنجاح.'
    ],
    'student' => [
        'not_found' => 'لم يتم ايجاد الطالب.'
    ]
];
