<?php

return [
    'user' => [
        'created' => 'تم إنشاء المستخدم بنجاح.',
        'updated' => 'تم تحديث بيانات المستخدم بنجاح.',
        'deleted' => 'تم حذف المستخدم بنجاح.',
        'not-found' => 'لم يتم العثور على المستخدم.',
        'image_upload_failed'=>'فشل تحميل الصورة.',
        'device_exists' => 'الجهاز مسجل فعلا.'
    ],
    'auth' => [
        'login' => 'تم تسجيل الدخول بنجاح.',
        'logout' => 'تم تسجيل الخروج بنجاح.',
        'permission_denied' => 'ليس لديك صلاحية للقيام بهذا الأمر.',
        'invalid_password' => 'كلمة مرور غير صحيحة!.',
        'invalid_token' => '.الرمز غير صحيح او منتهي الصلاحية',
        'refresh' => 'تم تحديث الرمز.',
        'password_changed' => 'تم تغيير كلمة المرور بنجاح.',
        'reset_link_sent' => 'تم ارسال رابط اعادة تعيين كلمة السر.'
    ],
    'quiz' => [
        'created' => 'تم إنشاء الاختبار المؤتمت بنجاح.',
        'activated' => 'تم تفعيل الاختبار المؤتمت بنجاح.',
        'not-found' => 'لم يتم إيجاد الاختبار المؤتمت.',
        'already_active' => 'الاختبار المؤتمت مفعل بالفعل.',
        'deactivated' => 'تم تعطيل الاختبار المؤتمت بنجاح.',
        'already_inactive' => 'الاختبار المؤتمت معطل بالفعل.',
        'updated' => 'تم تعديل الاختبار المؤتمت.'
    ]
];
