<?php

return [
    'user' => [
        'created' => 'تم إنشاء المستخدم بنجاح.',
        'updated' => 'تم تحديث بيانات المستخدم بنجاح.',
        'deleted' => 'تم حذف المستخدم بنجاح.',
        'not-found' => 'لم يتم العثور على المستخدم.',
        'image_upload_failed'=>'فشل تحميل الصورة.',
    ],
    'auth' => [
        'login' => 'تم تسجيل الدخول بنجاح.',
        'logout' => 'تم تسجيل الخروج بنجاح.',
        'permission_denied' => 'ليس لديك صلاحية للقيام بهذا الأمر.',
        'invalid_password' => 'كلمة مرور غير صحيحة!.',
        'invalid_token' => '.الرمز غير صحيح او منتهي الصلاحية',
        'refresh' => 'تم تحديث الرمز.',
        'password_changed' => 'تم تغيير كلمة المرور بنجاح.',
        'reset_link_sent' => 'تم ارسال رابط اعادة تعيين كلمة السر.'
    ],
];
